## fillna syntex
 - DataFrame.fillna(vlaue=None, method=None, axis=None, inplace=False,limit=None, downcast=None)

In [1]:
import pandas as pd

In [3]:
data = pd.read_csv('data_mm.csv')
data

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

### Fill all NaN values with 0s

In [5]:
data.fillna(0)

      Name  Marks Grades
0  Priyang   98.0      0
1   Aadhya    0.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0      0
4   Parshv   90.0     AC
5   Mittal    0.0     BA
6  Archana   82.0     BB

### Fill all NaN values with mean value

In [6]:
data=pd.read_csv('data_new.csv')
data

        City  Temp
0  Ahmedabad  34.0
1      Anand   NaN
2     Baroda   NaN
3      Surat  40.0
4      Deihi   NaN
5   Banglore  45.0

In [7]:
data.fillna(data.mean())

C:\Users\Dell\AppData\Local\Temp\ipykernel_12716\3231489778.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.fillna(data.mean())

        City       Temp
0  Ahmedabad  34.000000
1      Anand  39.666667
2     Baroda  39.666667
3      Surat  40.000000
4      Deihi  39.666667
5   Banglore  45.000000

### Fill all NaN elements in columns 'Marks' and 'Grades' with 97 and 'AA' respectively.

In [12]:
data=pd.read_csv('data_mm.csv')
data

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

In [13]:
data.fillna({'Marks':97,'Grades':'AA'})

      Name  Marks Grades
0  Priyang   98.0     AA
1   Aadhya   97.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0     AA
4   Parshv   90.0     AC
5   Mittal   97.0     BA
6  Archana   82.0     BB

### Propagate non-null values forward

In [14]:
data=pd.read_csv('data_new.csv')
data

        City  Temp
0  Ahmedabad  34.0
1      Anand   NaN
2     Baroda   NaN
3      Surat  40.0
4      Deihi   NaN
5   Banglore  45.0

In [16]:
#data.fillna(method='pad')
data.fillna(method='ffill')

        City  Temp
0  Ahmedabad  34.0
1      Anand  34.0
2     Baroda  34.0
3      Surat  40.0
4      Deihi  40.0
5   Banglore  45.0

### Propagate non-null values backward.

In [18]:
data.fillna(method='backfill')

        City  Temp
0  Ahmedabad  34.0
1      Anand  40.0
2     Baroda  40.0
3      Surat  40.0
4      Deihi  45.0
5   Banglore  45.0

### Axis

In [22]:
data=pd.read_csv('data_new.csv')
data.fillna(method='ffill', axis='index')

        City  Temp
0  Ahmedabad  34.0
1      Anand  34.0
2     Baroda  34.0
3      Surat  40.0
4      Deihi  40.0
5   Banglore  45.0

In [24]:
data.fillna(method='ffill', axis='columns')

        City    Temp
0  Ahmedabad    34.0
1      Anand   Anand
2     Baroda  Baroda
3      Surat    40.0
4      Deihi   Deihi
5   Banglore    45.0

### inplace

In [ ]:
## inplace default value is false
### inplace=True >> existing data frame be changed permanently  ** need to assign to new object
new_df=data.fillna(method='ffill', inplace=True)

### Fill the first NaN element.

In [26]:
data.fillna(method='ffill', limit=1)

        City  Temp
0  Ahmedabad  34.0
1      Anand  34.0
2     Baroda   NaN
3      Surat  40.0
4      Deihi  40.0
5   Banglore  45.0

### downcast

In [27]:
df=pd.DataFrame({'a':[1,None]})
df

     a
0  1.0
1  NaN

In [28]:
df1=df.fillna(0,downcast='infer')
df1

   a
0  1
1  0

In [29]:
df2=df.fillna({'a':0},downcast='infer')
df2

   a
0  1
1  0